mchoo7/freebsd-src/share/man/man9/trap_cfi.9
.\"
.\" Copyright (c) 2026 FreeBSD Foundation
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Author: Minsoo Choo <mchoo@FreeBSD.org>
.\"
.Dd September 11, 2026
.Dt TRAP_CFI 9
.Os
.Sh NAME
.Nm trap_cfi_entry ,
.Nm trap_cfi_end ,
.Nm trap_cfi_saved ,
.Nm trap_cfi_full
.Nd describe kernel trap frames with DWARF call frame information
.Sh SYNOPSIS
.In machine/trap_cfi.h
.Bd -literal -offset indent
trap_cfi_entry name, state
trap_cfi_end name

trap_cfi_saved reg, offset
trap_cfi_full [mode]
.Ed
.Sh DESCRIPTION
The
.Nm
assembly interface emits DWARF call frame information (CFI) for kernel
exception, interrupt, and synthetic trap frames.
The information is stored in the loadable
.Li .eh_frame
section so that a debugger can unwind through a trap frame in a running
kernel or kernel core dump without an architecture-specific trap-frame
unwinder.
.Pp
Each supported architecture provides
.In machine/trap_cfi.h .
The macro names and lifecycle are common, while register numbers, trap-frame
offsets, and the final canonical frame address (CFA) are architecture-specific.
The generated offsets from
.Pa assym.inc
must be visible before macros which use them are expanded.
.Pp
A CFI range is opened with
.Nm trap_cfi_entry
and must be closed exactly once with
.Nm trap_cfi_end .
These macros own the corresponding
.Ic .cfi_startproc
and
.Ic .cfi_endproc
directives.
Trap assembly must not emit another pair for the same range.
The
.Ar name
argument identifies the range to readers of the assembly source; normal
architecture assembly macros or labels still declare the symbol itself.
.Pp
.Nm trap_cfi_entry
marks the FDE as a signal frame, selects the architectural interrupted-PC
column as the return-address column, initializes the CFA, and initially marks
the interrupted PC as undefined.
The
.Ar state
argument describes the trap frame at the first instruction in the range:
.Bl -tag -width terminal
.It Sy empty
The trap frame is absent or only partially constructed.
The assembly must update the CFA and saved-register rules immediately after
each instruction which changes the stack pointer or saves a register.
This is the default state.
.It Sy full
A complete trap frame already exists at entry.
The architecture's complete trap-frame register map is installed at the
first instruction.
This state is suitable for a nonterminal synthetic frame such as a process
.Fn fork_trampoline .
.It Sy terminal
A synthetic stack frame exists, but it has no caller.
The macro describes its CFA and leaves the interrupted-PC column explicitly
undefined.
A terminal frame must not recover a zero PC from memory as an end-of-stack
marker.
.El
.Pp
On 32-bit ARM the locations of the interrupted stack pointer and link
register depend on whether the exception originated in user or privileged
mode.
Such code opens an
.Sy empty
range and invokes
.Nm trap_cfi_full
with a
.Sy user
or
.Sy kernel
mode argument once the origin is known.
.Pp
Some PowerPC entry macros open an ordinary CFI procedure as part of their ABI
entry sequence.
The PowerPC-only
.Sy attached
state attaches signal-frame rules to that already-open procedure instead of
opening a nested procedure.
New trap entry code should prefer a range whose lifecycle is owned entirely
by
.Nm trap_cfi_entry
and
.Nm trap_cfi_end .
.Ss Register rules
.Nm trap_cfi_saved
records that the caller value of
.Ar reg
is stored in the trap-frame slot at
.Ar offset .
The architecture implementation converts the trap-frame offset to an offset
relative to its final CFA.
.Pp
.Nm trap_cfi_full
installs the complete register map for an already-constructed trap frame.
It includes all saved general-purpose registers and the interrupted PC.
Architectures may additionally describe status or control registers which
have stable DWARF register numbers.
.Pp
Architecture headers may provide helpers for transitions unique to that
architecture.
For example, AMD64 provides rules for the hardware-created machine frame and
for ranges in which general-purpose registers are live rather than saved.
Such helpers do not change ownership of the CFI procedure lifecycle.
.Ss Construction requirements
CFI rules describe machine state at an instruction address, not merely the
state eventually reached by the handler.
Consequently, the following requirements apply:
.Bl -bullet
.It
Update the CFA immediately after every instruction which changes the stack
pointer.
.It
Add a saved-register rule immediately after the instruction which makes the
saved value available in memory.
.It
Use a stable CFA which makes forward stack progress.
Give the interrupted architectural stack pointer its own recovery rule when
it differs from the CFA.
.It
Use the interrupted-PC slot as the return-address column when the
architecture has separate PC and link-register columns.
.It
Keep entry paths in separate FDE ranges until their unwind rules become
identical.
Do not merge differently described wrappers into ambiguous common assembly.
.It
Once the trap frame is no longer addressable, mark the interrupted-PC column
undefined before transferring control to the interrupted context.
.It
For a deliberately terminal synthetic state, emit a signal-frame FDE with an
explicitly undefined return-address column.
.El
.Sh EXAMPLES
The following schematic handler constructs a trap frame incrementally:
.Bd -literal -offset indent
exception_handler:
	trap_cfi_entry exception_handler, empty
	sub	sp, sp, TF_SIZE
	.cfi_def_cfa_offset CFI_TF_SIZE
	store	r0, TF_R0(sp)
	trap_cfi_saved r0, TF_R0
	...
	trap_cfi_end exception_handler
.Ed
.Pp
A synthetic process-return frame is complete before its first instruction:
.Bd -literal -offset indent
fork_trampoline:
	trap_cfi_entry fork_trampoline, full
	...
	trap_cfi_end fork_trampoline
.Ed
.Pp
A never-run kernel thread has no interrupted caller:
.Bd -literal -offset indent
fork_trampoline_kthread:
	trap_cfi_entry fork_trampoline_kthread, terminal
	call	fork_exit
	...
	trap_cfi_end fork_trampoline_kthread
.Ed
.Sh SEE ALSO
.Xr elf 5
.\" TODO: Add debuggers like lldb(1) when CFI support is complete.
.Sh HISTORY
The
.Nm trap_cfi
assembly interface first appeared in
.Fx 16.0 .
.Sh AUTHORS
The
.Nm trap_cfi
assembly interface was developed by
.An Minsoo Choo Aq Mt mchoo@FreeBSD.org
under sponsorship from the
.Fx
Foundation.
